tutorials/heatTransfer/buoyantSimpleRadiationFoam/hotRadiationRoomFvDOM/constant/polyMesh/blockMeshDict
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 0.0  0.0  0.0)
    ( 0.5  0.0  0.0)
    ( 1.5  0.0  0.0)
    (10.0  0.0  0.0)
    ( 0.0  0.5  0.0)
    ( 0.5  0.5  0.0)
    ( 1.5  0.5  0.0)
    (10.0  0.5  0.0)
    ( 0.0  1.5  0.0)
    ( 0.5  1.5  0.0)
    ( 1.5  1.5  0.0)
    (10.0  1.5  0.0)
    ( 0.0  6.0  0.0)
    ( 0.5  6.0  0.0)
    ( 1.5  6.0  0.0)
    (10.0  6.0  0.0)

    ( 0.0  0.0  0.5)
    ( 0.5  0.0  0.5)
    ( 1.5  0.0  0.5)
    (10.0  0.0  0.5)
    ( 0.0  0.5  0.5)
    ( 0.5  0.5  0.5)
    ( 1.5  0.5  0.5)
    (10.0  0.5  0.5)
    ( 0.0  1.5  0.5)
    ( 0.5  1.5  0.5)
    ( 1.5  1.5  0.5)
    (10.0  1.5  0.5)
    ( 0.0  6.0  0.5)
    ( 0.5  6.0  0.5)
    ( 1.5  6.0  0.5)
    (10.0  6.0  0.5)

    ( 0.0  0.0  2.0)
    ( 0.5  0.0  2.0)
    ( 1.5  0.0  2.0)
    (10.0  0.0  2.0)
    ( 0.0  0.5  2.0)
    ( 0.5  0.5  2.0)
    ( 1.5  0.5  2.0)
    (10.0  0.5  2.0)
    ( 0.0  1.5  2.0)
    ( 0.5  1.5  2.0)
    ( 1.5  1.5  2.0)
    (10.0  1.5  2.0)
    ( 0.0  6.0  2.0)
    ( 0.5  6.0  2.0)
    ( 1.5  6.0  2.0)
    (10.0  6.0  2.0)
);

blocks
(
    hex ( 0  1  5  4 16 17 21 20) ( 5  5  5) simpleGrading (1 1 1)
    hex ( 1  2  6  5 17 18 22 21) (10  5  5) simpleGrading (1 1 1)
    hex ( 2  3  7  6 18 19 23 22) (80  5  5) simpleGrading (1 1 1)
    hex ( 4  5  9  8 20 21 25 24) ( 5 10  5) simpleGrading (1 1 1)
    hex ( 6  7 11 10 22 23 27 26) (80 10  5) simpleGrading (1 1 1)
    hex ( 8  9 13 12 24 25 29 28) ( 5 40  5) simpleGrading (1 1 1)
    hex ( 9 10 14 13 25 26 30 29) (10 40  5) simpleGrading (1 1 1)
    hex (10 11 15 14 26 27 31 30) (80 40  5) simpleGrading (1 1 1)

    hex (16 17 21 20 32 33 37 36) ( 5  5 15) simpleGrading (1 1 1)
    hex (17 18 22 21 33 34 38 37) (10  5 15) simpleGrading (1 1 1)
    hex (18 19 23 22 34 35 39 38) (80  5 15) simpleGrading (1 1 1)
    hex (20 21 25 24 36 37 41 40) ( 5 10 15) simpleGrading (1 1 1)

    hex (21 22 26 25 37 38 42 41) (10 10 15) simpleGrading (1 1 1)

    hex (22 23 27 26 38 39 43 42) (80 10 15) simpleGrading (1 1 1)
    hex (24 25 29 28 40 41 45 44) ( 5 40 15) simpleGrading (1 1 1)
    hex (25 26 30 29 41 42 46 45) (10 40 15) simpleGrading (1 1 1)
    hex (26 27 31 30 42 43 47 46) (80 40 15) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall box
    (
        ( 6 22 21  5)
        (10 26 22  6)
        ( 9 25 26 10)
        ( 5 21 25  9)
        (22 26 25 21)
    )
    wall floor
    (
        ( 1  5  4  0)
        ( 2  6  5  1)
        ( 3  7  6  2)
        ( 5  9  8  4)
        ( 7 11 10  6)
        ( 9 13 12  8)
        (10 14 13  9)
        (11 15 14 10)
    )
    wall ceiling
    (
        (33 37 36 32)
        (34	38 37 33)
        (35 39 38 34)
        (37 41 40 36)
        (38 42 41 37)
        (39 43 42 38)
        (41 45 44 40)
        (42 46 45 41)
        (43 47 46 42)
    )
    wall fixedWalls
    (
        ( 1 17 16  0)
        ( 2 18 17  1)
        ( 3 19 18  2)
        (17 33 32 16)
        (18 34 33 17)
        (19 35 34 18)

        ( 7 23 19  3)
        (11 27 23  7)
        (15 31 27 11)
        (23 39 35 19)
        (27 43 39 23)
        (31 47 43 27)

        (14 30 31 15)
        (13 29 30 14)
        (12 28 29 13)
        (30 46 47 31)
        (29 45 46 30)
        (28 44 45 29)

        ( 8 24 28 12)
        ( 4 20 24  8)
        ( 0 16 20  4)
        (24 40 44 28)
        (20 36 40 24)
        (16 32 36 20)
    )
);

mergePatchPairs
(
);

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
